IdeaRS.OpenModel.Parameters.NumberGroups
Defines used input of groups of numbers.

IdeaRS.OpenModel.Parameters.NumberGroups.Create(System.Double)
Creates new instance with one group with one value.
value: The value to set to group.
Returns: A new instance of group.

IdeaRS.OpenModel.Parameters.NumberGroups.Create(System.Double,System.Int32)
Creates a new instance of one group with several values (defined by count).
value: The input value.
count: The count, defined value repeating.
Returns: A new instance of group.

IdeaRS.OpenModel.Parameters.NumberGroups.Create(System.Collections.Generic.IEnumerable{System.Double})
Creates new instance with one group with specified sequence of numbers.
positions: The sequence of numbers to add to group.
Returns: A new instance of group.

IdeaRS.OpenModel.Parameters.NumberGroups.Create(System.Double[])
Creates new instance with one group with specified sequence of numbers.
positions: The sequence of numbers to add to group.
Returns: A new instance of group.

IdeaRS.OpenModel.Parameters.NumberGroups.CreateGroups(System.Collections.Generic.IEnumerable{System.Double})
Creates new instance with groups with with one value in group.
positions: The sequence of numbers to create groups.
Returns: A new instance of groups.

IdeaRS.OpenModel.Parameters.NumberGroups.CreateGroups(System.Double[])
Creates new instance with groups with with one value in group.
positions: The sequence of numbers to create groups.
Returns: A new instance of groups.